[{"id":1,"name":"Борщевик Сосновского. В МО ввели штрафы за распространение","content":"1 ноября 2018 года Московская Область, без объявления войны (объявленной парой лет ранее), ввела финансовые санкции. Против собственников территорий, предоставляющих плацдарм для распространения борщевика Сосновского. Ура!Мне, правда, интересно, кто будет платить за титаническую плантацию борщевика между Шереметьево и ниткой Аэроэкспресса. Плантацию, встречающую гостей и жителей Москву сразу по прилёту в белокаменную. Там растут просто миллионы штрафа. Что же такое борщевик Сосновского и почему с ним надо бороться. Как это делать. Как это делать не нужно. А так же научные и псевдонаучные факты в нескучно-популярном изложении."},
{"id":2,"name":"Трагикомедия в NaN актах: как мы cделали игру на JS и выпустили ее в Steam","content":"“Эка невидаль”, — скажете вы, — “В топ-100 вашей игры нет, так что нещитово”. Тоже правда. Зато за год разработки Protolife мы поднакопили какой-никакой опыт, которым можем поделиться с потенциальными будущими игроделами. Ветераны индустрии, боюсь, ничего интересного для себя не найдут. Но, может быть, хоть повеселитесь от души. "},
{"id":3,"name":"Триумф и трагедия «Бурана»","content":"Ровно 30 лет назад с космодрома Байконур на ракете-носителе «Энергия» в свой единственный полёт отправился корабль «Буран». В полностью автоматическом режиме он совершил 2 витка вокруг Земли и успешно приземлился спустя 205 минут. Это стало несомненным триумфом советской космонавтики, впервые в мире сумевшей посадить многоразовый космоплан в автоматическом режиме на землю."},
{"id":4,"name":"Смешные и грустные истории про разработку компьютерных игр","content":"Только через смех можно рассказывать, как плоды долгой и упорной работы распространяются по всем компьютерам страны, но не приносят ни капли дохода. Только улыбка поможет принять хорошее, честное предложение распределения прибыли 1 к 12, где 1 — разработчику, а остальное агрегатору. И трудно слегка не загрустить, слушая о том удивительном времени абсолютно пустого рынка мобильных игр и почти азартном энтузиазме разработчиков. И, наверное, только у Вадима Башурова (PapaBubaDiop) такой длинный путь и невероятный опыт, чтобы иметь в запасе множество невыдуманных смешных и грустных историй."},
{"id":5,"name":"Стековая машина на моноидах","content":"Не так давно на Хабре появилась отличная и вдохновляющая статья про компиляторы и стековые машины. В ней показывается путь от простой реализации исполнителя байт-кода ко всё более и более эффективным версиям. Мне захотелось показать на примере разработки стековой машины, как это можно сделать Haskell-way."},
{"id":6,"name":"Несертифицированный GPS-трекер из Китая. Законно ли в России?","content":"Иностранные интернет-магазины завалены разнообразными устройствами, оснащёнными GPS, GSM-модулями, позволяющими отслеживать местоположение наблюдаемого объекта и управлять устройством посредством SMS и мобильных приложений. И, конечно же, большинство из них не сертифицированы и запрещены для ввоза/использования в России. Простой обыватель, услышав слова «несертифицированный» и «GPS» в одном предложении, скажет: «Это незаконно по статье 138.1 УК РФ!», и будет прав. А может и нет. Во всём этом я попытался разобраться и сконсолидировать в этой статье."},
{"id":7,"name":"Крупнейшая курьерская компания из Китая начинает использовать беспилотные «кукурузники» для перевозки грузов","content":"Дроны, беспилотные летательные аппараты — перспективное транспортное средство для курьерских компаний. Беспилотники могут быть очень разными, и китайская компания SF Express доказала это, начав эксплуатацию аппаратов Feihong 98. Они разработаны на базе многоцелевого биплана Y-5B, который, в свою очередь, создан на основе советского Ан-2, то есть «кукурузника»."},
{"id":8,"name":"Учёные смущённо признают, что до сих пор не знают точной величины гравитационного взаимодействия","content":"По легенде, первый эксперимент, показавший, что все объекты падают с одной скоростью, вне зависимости от массы, провёл Галилео Галилей, стоя на вершине Пизанской башни. Два любых объекта, брошенных вниз в гравитационном поле, в отсутствии сопротивления воздуха (или при пренебрежении им) будут ускоряться одинаково. Позже это правило было кратко записано Ньютоном после изучения им данного вопроса."},
{"id":9,"name":"Julia. Работа с таблицами","content":"Julia — один из самых молодых математических языков программирования, претендующий на роль основного языка программирования в этой сфере. К сожалению, на данный момент достаточно мало литературы на русском языке, а материалы, доступные на английском языке, содержат сведения, которые, в силу динамичности развития Julia, не всегда соответствуют текущей версии, но это не очевидно для начинающих Julia-программистов. Постараемся восполнить пробелы и донести идеи Julia до читателей в виде простых примеров."},
{"id":10,"name":"Волновые процессы в гидравлических линиях. Основы","content":"Привет, Хабр! В предыдущей статье я рассказывал про метод характеристик, предназначенный для расчёта волновых процессов в гидравлических линиях. На самом деле, конечно же, волновые процессы можно рассчитывать и в уме, нужно только знать подход. "},
{"id":11,"name":"Рукоятка","content":"Рукоятка крепится на шарнире. Можно выбрать либо прямое положение, либо пистолетное."},
{"id":12,"name":"У московского бизнесмена","content":"У московского бизнесмена из автомобиля украли шесть миллионов рублей"},
{"id":13,"name":"Креативное агентство Jvision","content":"Креативное агентство Jvision, запустило сервис, способствующий развитию автомобильного туризма в России"},
{"id":14,"name":"Просто авто","content":"Просто авто"},
{"id":15,"name":"Японские автомобили","content":"Японские автомобили вновь заняли в США первые места в рейтингах"},
{"id":16,"name":"Январский дефицит","content":"Январский дефицит платежного баланса Японии превысил $5 млрд"},
{"id":17,"name":"Японская корпорация Sony","content":"Японская корпорация Sony представила новый смартфон под названием Xperia Sola"},
{"id":18,"name":"Просто странный текст","content":"без всего не было бы более менее нормально"},
{"id":19,"name":"Many people","content":"Many people have speculated that if we knew exactly why the bowl of petunias had thought that we would know a lot more about the nature of the Universe than we do now."},
{"id":20,"name":"Facebook and the Fires","content":"The toxic smoke is a bleak backdrop and an apt metaphor for where Silicon Valley finds itself. By Kara Swisher. When I flew into San Francisco on Nov. 11, the haze shrouding the city was not the usual charming fog, and there was an acrid smell, like a barbecue on steroids. California was on fire."},
{"id":21,"name":"The Future Of Voice Control","content":"Voice recognition is the ability of a machine or program to understand and carry out spoken commands. We have come a long way from having to pronounce every single syllable in a desperate attempt that a phone operator will be able to understand us. We now live in an age where Google and Alexa are taking over our homes. By the end of 2017 Google and Amazon collectively sold 27 million devices, this is significant as it shows us that this isn’t just a trend it’s a paradigm shift in the way in which we interact with devices. So let’s keep a peek in to the not so distant future to see what voice control has in-store for us."},
{"id":22,"name":"Why Tesla Batteries Won’t Work for Air Taxis: A First Principles Approach","content":"Over the last 20 years, batteries have been one of the slowest developed hardware components in the world. Solar power, advanced materials, and next generation manufacturing processes have all sparked new business and provided the technological momentum to create new industries. All but the battery. In order for the Urban Air Mobility industry to accomplish the major tenet of environmental sustainability, battery tech needs to catch up. So why the lag? And how have companies like Tesla and Faraday Future been able to bring their products to market despite the challenges that battery technology provides?"},
{"id":23,"name":"The Least Imaginative Holiday Gift Is the One Everyone Will Be Getting","content":"Tech companies are asking one big question this holiday season: Which screen do you want to unwrap? There is a banality to the would-be gadget gifts introduced in 2018. So many of them are large, flat panes of glass, dark and featureless until you power them up. It makes you long for the days of a Lionel Train marking its circuitous route around the Christmas tree."}]